# SQL Select

## Exercise 1
Insert the missing statement to get all the columns from the Customers table.

In [ ]:
SELECT * FROM Customers;

## Exercise 2
Write a statement that will select the City column from the Customers table.

In [ ]:
SELECT City FROM Customers;

## Exercise 3
Select all the different values from the Country column in the Customers table.

In [ ]:
SELECT DISTINCT Country FROM Customers;

# SQL Where

## Exercise 1
Select all records where the City column has the value "Berlin".

In [ ]:
SELECT * FROM Customers
WHERE City = 'Berlin';

## Exercise 2
Use the NOT keyword to select all records where City is NOT "Berlin".

In [ ]:
SELECT * FROM Customers
WHERE NOT City = 'Berlin';

## Exercise 3
Select all records where the CustomerID column has the value 32.

In [ ]:
SELECT * FROM Customers
WHERE CustomerID = 32;

## Exercise 4
Select all records where the City column has the value 'Berlin' and the PostalCode column has the value 12209.

In [ ]:
SELECT * FROM Customers
WHERE City = 'Berlin'
AND PostalCode = 12209;

## Exercise 5
Select all records where the City column has the value 'Berlin' or 'London'.

In [ ]:
SELECT * FROM Customers
WHERE City = 'Berlin'
OR City = 'London';

# SQL Order By

## Exercise 1
Select all records from the Customers table, sort the result alphabetically by the column City.

In [ ]:
SELECT * FROM Customers
ORDER BY City;

## Exercise 2
Select all records from the Customers table, sort the result reversed alphabetically by the column City.

In [ ]:
SELECT * FROM Customers
ORDER BY City DESC;

## Exercise 3
Select all records from the Customers table, sort the result alphabetically, first by the column Country, then, by the column City.

In [ ]:
SELECT * FROM Customers
ORDER BY Country, City;

# SQL Insert

## Exercise 1
Insert a new record in the Customers table.

In [ ]:
INSERT INTO Customers (
CustomerName, 
Address, 
City, 
PostalCode,
Country)
VALUES (
'Hekkan Burger',
'Gateveien 15',
'Sandnes',
'4306',
'Norway');

# SQL Null

## Exercise 1
Select all records from the Customers where the PostalCode column is empty.

In [ ]:
SELECT * FROM Customers
WHERE PostalCode IS NULL;

## Exercise 2
Select all records from the Customers where the PostalCode column is NOT empty.

In [ ]:
SELECT * FROM Customers
WHERE PostalCode IS NOT NULL;

# SQL Update

## Exercise 1
Update the City column of all records in the Customers table.

In [ ]:
UPDATE Customers
SET City = 'Oslo';

## Exercise 2
Set the value of the City columns to 'Oslo', but only the ones where the Country column has the value "Norway".

In [ ]:
UPDATE Customers
SET City = 'Oslo'
WHERE Country = 'Norway';

## Exercise 3
Update the City value and the Country value.

In [ ]:
UPDATE Customers
SET City = 'Oslo', Country = 'Norway'
WHERE CustomerID = 32;

# SQL Delete

## Exercise 1
Delete all the records from the Customers table where the Country value is 'Norway'.

In [ ]:
DELETE FROM Customers
WHERE Country = 'Norway';

## Exercise 2
Delete all the records from the Customers table.

In [ ]:
DELETE FROM Customers;

# SQL Functions

## Exercise 1
Use the MIN function to select the record with the smallest value of the Price column.

In [ ]:
SELECT MIN(Price) 
FROM Products;

## Exercise 2
Use an SQL function to select the record with the highest value of the Price column.

In [ ]:
SELECT MAX(Price)
FROM Products;

## Exercise 3
Use the correct function to return the number of records that have the Price value set to 18.

In [ ]:
SELECT COUNT(*)
FROM Products
WHERE Price = 18;

## Exercise 4
Use an SQL function to calculate the average price of all products.

In [ ]:
SELECT AVG(Price) 
FROM Products;

## Exercise 5
Use an SQL function to calculate the sum of all the Price column values in the Products table.

In [ ]:
SELECT SUM(Price)
FROM Products;

# SQL Like

## Exercise 1
Select all records where the value of the City column starts with the letter "a".

In [ ]:
SELECT * FROM Customers
WHERE City LIKE 'a%';

## Exercise 2
Select all records where the value of the City column ends with the letter "a".

In [ ]:
SELECT * FROM Customers
WHERE City LIKE '%a';

## Exercise 3
Select all records where the value of the City column contains the letter "a".

In [ ]:
SELECT * FROM Customers
WHERE City LIKE '%a%';

## Exercise 4
Select all records where the value of the City column starts with letter "a" and ends with the letter "b".

In [ ]:
SELECT * FROM Customers
WHERE City LIKE 'a%b';

## Exercise 5
Select all records where the value of the City column does NOT start with the letter "a".

In [ ]:
SELECT * FROM Customers
WHERE City NOT LIKE 'a%';

# SQL Wildcards

## Exercise 1
Select all records where the second letter of the City is an "a".

In [ ]:
SELECT * FROM Customers
WHERE City LIKE '_a%';

## Exercise 2
Select all records where the first letter of the City is an "a" or a "c" or an "s".

In [ ]:
SELECT * FROM Customers
WHERE City LIKE '[acs]%';

## Exercise 3
Select all records where the first letter of the City starts with anything from an "a" to an "f".

In [ ]:
SELECT * FROM Customers
WHERE City LIKE '[a-f]%';

## Exercise 4
Select all records where the first letter of the City is NOT an "a" or a "c" or an "f".

In [ ]:
SELECT * FROM Customers
WHERE City LIKE '[^acf]%';

# SQL In

## Exercise 1
Use the IN operator to select all the records where Country is either "Norway" or "France".

In [ ]:
SELECT * FROM Customers
WHERE Country IN ('Norway', 'France');

## Exercise 2
Use the IN operator to select all the records where Country is NOT "Norway" and NOT "France".

In [ ]:
SELECT * FROM Customers
WHERE Country NOT IN ('Norway', 'France');

# SQL Between

## Exercise 1
Use the BETWEEN operator to select all the records where the value of the Price column is between 10 and 20.

In [ ]:
SELECT * FROM Products
WHERE Price BETWEEN 10 AND 20;

## Exercise 2
Use the BETWEEN operator to select all the records where the value of the Price column is NOT between 10 and 20.

In [ ]:
SELECT * FROM Products
WHERE Price NOT BETWEEN 10 AND 20;

## Exercise 3
Use the BETWEEN operator to select all the records where the value of the ProductName column is alphabetically between 'Geitost' and 'Pavlova'.

In [ ]:
SELECT * FROM Products
WHERE ProductName BETWEEN 'Geitost' AND 'Pavlova';

# SQL Alias

## Exercise 1
When displaying the Customers table, make an ALIAS of the PostalCode column, the column should be called Pno instead.

In [ ]:
SELECT CustomerName,
Address,
PostalCode 
AS Pno
FROM Customers;

## Exercise 2
When displaying the Customers table, refer to the table as Consumers instead of Customers.

In [ ]:
SELECT *
FROM Customers AS Consumers;

# SQL Join

## Exercise 1
Insert the missing parts in the JOIN clause to join the two tables Orders and Customers, using the CustomerID field in both tables as the relationship between the two tables.

In [ ]:
SELECT *
FROM Orders
LEFT JOIN Customers
ON Orders.CustomerID=Customers.CustomerID;

## Exercise 2
Choose the correct JOIN clause to select all records from the two tables where there is a match in both tables.

In [ ]:
SELECT *
FROM Orders
INNER JOIN Customers
ON Orders.CustomerID=Customers.CustomerID;

## Exercise 3
Choose the correct JOIN clause to select all the records from the Customers table plus all the matches in the Orders table.

In [ ]:
SELECT *
FROM Orders
RIGHT JOIN Customers
ON Orders.CustomerID=Customers.CustomerID;

# SQL Group By

## Exercise 1
List the number of customers in each country.

In [ ]:
SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country;

## Exercise 2
List the number of customers in each country, ordered by the country with the most customers first.

In [ ]:
SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country
ORDER BY COUNT(CustomerID) DESC;

# SQL Database

## Exercise 1
Write the correct SQL statement to create a new database called testDB.

In [ ]:
CREATE DATABASE testDB;

## Exercise 2
Write the correct SQL statement to delete a database named testDB.

In [ ]:
DROP DATABASE testDB;

## Exercise 3
Write the correct SQL statement to create a new table called Persons.

In [ ]:
CREATE TABLE Persons (
  PersonID int,
  LastName varchar(255),
  FirstName varchar(255),
  Address varchar(255),
  City varchar(255)
);

## Exercise 4
Write the correct SQL statement to delete a table called Persons.

In [ ]:
DROP TABLE Persons;

## Exercise 5
Use the TRUNCATE statement to delete all data inside a table.

In [ ]:
TRUNCATE TABLE Persons;

## Exercise 6
Add a column of type DATE called Birthday.

In [ ]:
ALTER TABLE Persons
ADD Birthday DATE;

## Exercise 7
Delete the column Birthday from the Persons table.

In [ ]:
ALTER TABLE Persons
DROP COLUMN Birthday;